# Assignment Pandas 1

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
a = [4,8,15,16,23,42]
b =pd.Series(a)
b

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
s = [1,2,3,'ss',6.66,7,8,9,0,888]
f = pd.Series(s)
f

0       1
1       2
2       3
3      ss
4    6.66
5       7
6       8
7       9
8       0
9     888
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
dict1 = {'Name':['Alice','bob','Claire'],
       'Age':[25,30,27],
       'Gender':['F','M','F']}
df = pd.DataFrame(dict1)
df

     Name  Age Gender
0   Alice   25      F
1     bob   30      M
2  Claire   27      F

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A dataframe is a 2 dimensional data structure that can we used to store, manipulate and perform operations on data like csv, excel. Similarly a series can contain only single index, while df can have many.

In [12]:
dict1 = {'Name':['Alice','bob','Claire'],
       'Age':[25,30,27],
       'Gender':['F','M','F']}
df1 = pd.Series(dict1)
df1

Name      [Alice, bob, Claire]
Age               [25, 30, 27]
Gender               [F, M, F]
dtype: object

In [15]:
df

     Name  Age Gender
0   Alice   25      F
1     bob   30      M
2  Claire   27      F

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Data Manipulation like dropping row, renaming column, slicing can be done using pandas

In [25]:
df2 = df.drop('Name', axis = 1)
df2 = df2.rename(columns = {'Gender':'Sex'})
df2

   Age Sex
0   25   F
1   30   M
2   27   F

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame. However, the vast majority of methods produce new objects and leave the input data untouched. In general we like to favor immutability where sensible.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
f

0       1
1       2
2       3
3      ss
4    6.66
5       7
6       8
7       9
8       0
9     888
dtype: object

In [27]:
b

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [32]:
pd.DataFrame(f)

      0
0     1
1     2
2     3
3    ss
4  6.66
5     7
6     8
7     9
8     0
9   888